In [1]:
import pandas as pd
import numpy as np

In [2]:
area_dict = {'California':423967, 
            'Texas': 695662,
            'New York': 141297,
            'Florida': 170312,
            'Illinois': 149995}

In [3]:
area = pd.Series(area_dict)
area

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
dtype: int64

In [4]:
population_dict = {'California': 38332521,
                  'Texas': 26448193,
                  'New York': 19651127,
                  'Florida': 19552860,
                  'Illinois': 12882135}
population = pd.Series(population_dict)
population

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

In [5]:
states = pd.DataFrame({'population': population,
                      'area': area})
states

            population    area
California    38332521  423967
Texas         26448193  695662
New York      19651127  141297
Florida       19552860  170312
Illinois      12882135  149995

In [6]:
states.index

Index(['California', 'Texas', 'New York', 'Florida', 'Illinois'], dtype='object')

In [7]:
states.columns

Index(['population', 'area'], dtype='object')

In [8]:
states['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [9]:
pd.DataFrame(population, columns=['popln'])

               popln
California  38332521
Texas       26448193
New York    19651127
Florida     19552860
Illinois    12882135

In [10]:
data = [{'a': i, 'b': 2 * i} for i in range(3)]
data

[{'a': 0, 'b': 0}, {'a': 1, 'b': 2}, {'a': 2, 'b': 4}]

In [11]:
pd.DataFrame(data)

   a  b
0  0  0
1  1  2
2  2  4

In [12]:
pd.DataFrame([{'a': 1, 'b': 2}, {'b': 3, 'c': 4}])

     a  b    c
0  1.0  2  NaN
1  NaN  3  4.0

In [13]:
pd.DataFrame({'population': population,
             'area': area})

            population    area
California    38332521  423967
Texas         26448193  695662
New York      19651127  141297
Florida       19552860  170312
Illinois      12882135  149995

In [16]:
pd.DataFrame(np.random.rand(3,2), index=['a','b','c'], columns=['foo', 'bar'])

        foo       bar
a  0.561784  0.949098
b  0.817913  0.564545
c  0.099559  0.595611

In [17]:
ind = pd.Index([2,3,5,7,11])
ind

Int64Index([2, 3, 5, 7, 11], dtype='int64')

In [18]:
ind[2]

5

In [19]:
ind[1]

3

In [20]:
ind[::2]

Int64Index([2, 5, 11], dtype='int64')

In [21]:
print(ind.size, ind.shape, ind.dtype, ind.ndim)

5 (5,) int64 1

In [22]:
print(area.size, area.shape, area.dtype, area.ndim)

5 (5,) int64 1

In [23]:
indA = pd.Index([1,3,5,7,9])
indB = pd.Index([2,3,5,7,11])

In [24]:
indA & indB

/tmp/ipykernel_5644/144964795.py:1: FutureWarning: Index.__and__ operating as a set operation is deprecated, in the future this will be a logical operation matching Series.__and__.  Use index.intersection(other) instead.
  indA & indB

Int64Index([3, 5, 7], dtype='int64')

In [25]:
indA.intersection(indB)

Int64Index([3, 5, 7], dtype='int64')

In [26]:
indA.union(indB)

Int64Index([1, 2, 3, 5, 7, 9, 11], dtype='int64')

In [27]:
indA.symmetric_difference(indB)

Int64Index([1, 2, 9, 11], dtype='int64')

In [28]:
indA

Int64Index([1, 3, 5, 7, 9], dtype='int64')

In [29]:
indB

Int64Index([2, 3, 5, 7, 11], dtype='int64')

In [30]:
indA.difference(indB)

Int64Index([1, 9], dtype='int64')